app/Controllers/Berkas.php

INSERT INTO `berkas` (`berkas`, `keterangan`, `created_at`, `updated_at`) VALUES ('1671284483_1288ee7a98acc62dbb84.pdf', 'File Proposal Rizky Kurniawan', '2022-12-17 07:41:23', '2022-12-17 07:41:23')
---
	public function save()
	{


		$berkas = new BerkasModel();
		$dataBerkas = $this->request->getFile('berkas');

        if (!$this->validate([
			'keterangan' => [
				'rules' => 'required',
				'errors' => [
					'required' => '{field} Tidak boleh kosong'
				]
			],
			'berkas' => [
				'rules' => 'uploaded[berkas]|mime_in[berkas,application/pdf]|max_size[berkas,2048]',
				'errors' => [
					'uploaded' => 'Harus Ada File yang diupload',
					'mime_in' => 'Format File Harus Berupa pdf',
					'max_size' => 'Ukuran File Maksimal 2 MB'
				]

			]
		]))
		{
			session()->setFlashdata('error', $this->validator->listErrors());
			return redirect()->back()->withInput();
		}else {
			$fileName = $dataBerkas->getRandomName();
		$berkas->insert([
			'berkas' => $fileName,
			'keterangan' => $this->request->getPost('keterangan')
		]);